{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 64,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 64
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "not": 5,
      "are": 6,
      "your": 7,
      "my": 8,
      "day": 9,
      "and": 10,
      "boring": 11,
      "good": 12,
      "bad": 13,
      "may": 14,
      "really": 15,
      "been": 16,
      "actor": 17,
      "horrible": 18,
      "always": 19,
      "if": 20,
      "we": 21,
      "will": 22,
      "those": 23,
      "life": 24,
      "what": 25,
      "being": 26,
      "actress": 27,
      "their": 28,
      "its": 29,
      "both": 30,
      "you": 31,
      "or": 32,
      "but": 33,
      "mine": 34,
      "have": 35,
      "believe": 36,
      "only": 37,
      "terrible": 38,
      "show": 39,
      "like": 40,
      "it": 41,
      "he": 42,
      "story": 43,
      "me": 44,
      "were": 45,
      "her": 46,
      "more": 47,
      "awful": 48,
      "know": 49,
      "sometimes": 50,
      "character": 51,
      "hers": 52,
      "too": 53,
      "when": 54,
      "wonderful": 55,
      "that": 56,
      "i": 57,
      "some": 58,
      "should": 59,
      "even": 60,
      "fantastic": 61,
      "best": 62,
      "which": 63,
      "had": 64,
      "do": 65,
      "ours": 66,
      "them": 67,
      "love": 68,
      "man": 69,
      "film": 70,
      "might": 71,
      "the": 72,
      "watch": 73,
      "never": 74,
      "very": 75,
      "scene": 76,
      "shall": 77,
      "this": 78,
      "she": 79,
      "yours": 80,
      "theirs": 81,
      "just": 82,
      "his": 83,
      "does": 84,
      "less": 85,
      "these": 86,
      "great": 87,
      "enjoy": 88,
      "has": 89,
      "also": 90,
      "how": 91,
      "no": 92,
      "him": 93,
      "most": 94,
      "child": 95,
      "would": 96,
      "few": 97,
      "part": 98,
      "think": 99,
      "us": 100,
      "who": 101,
      "director": 102,
      "be": 103,
      "worst": 104,
      "acting": 105,
      "quite": 106,
      "did": 107,
      "amazing": 108,
      "movie": 109,
      "people": 110,
      "feel": 111,
      "see": 112,
      "they": 113,
      "woman": 114,
      "need": 115,
      "hate": 116,
      "want": 117,
      "could": 118,
      "time": 119,
      "world": 120,
      "excellent": 121,
      "was": 122,
      "an": 123,
      "all": 124,
      "still": 125,
      "end": 126,
      "so": 127,
      "is": 128,
      "plot": 129,
      "because": 130,
      "where": 131,
      "a": 132,
      "dull": 133,
      "often": 134,
      "way": 135,
      "year": 136,
      "our": 137
    }
  }
}